program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.4"}, {"coremlc-version", "1429.0.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 256, 256]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 256, 256]> image__scaled__ = mul(x = image, y = image__scaled___y_0);
            tensor<string, []> efficientnetv2_s_stem_Pad_mode_0 = const()[name = tensor<string, []>("efficientnetv2_s_stem_Pad_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_0_pad_0 = const()[name = tensor<string, []>("pad_0_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, []> efficientnetv2_s_stem_Pad_constant_val_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_stem_Pad_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 3, 256, 256]> cast_541 = cast(dtype = image_to_fp16_dtype_0, x = image__scaled__);
            tensor<fp16, [1, 3, 258, 258]> pad_0_cast = pad(constant_val = efficientnetv2_s_stem_Pad_constant_val_0_to_fp16, mode = efficientnetv2_s_stem_Pad_mode_0, pad = pad_0_pad_0, x = cast_541);
            tensor<string, []> efficientnetv2_s_stem_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_stem_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_stem_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_stem_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> efficientnetv2_s_stem_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_stem_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_stem_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_stem_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_stem_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_stem_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 3, 3, 3]> efficientnetv2_s_stem_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_stem_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [24, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [24]> efficientnetv2_s_stem_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_stem_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1472)))];
            tensor<fp16, [1, 24, 128, 128]> efficientnetv2_s_stem_tpu_batch_normalization_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_stem_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_stem_conv2d_Conv2Dx_dilations_0, groups = efficientnetv2_s_stem_conv2d_Conv2Dx_groups_0, pad = efficientnetv2_s_stem_conv2d_Conv2Dx_pad_0, pad_type = efficientnetv2_s_stem_conv2d_Conv2Dx_pad_type_0, strides = efficientnetv2_s_stem_conv2d_Conv2Dx_strides_0, weight = efficientnetv2_s_stem_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16, x = pad_0_cast);
            tensor<fp16, [1, 24, 128, 128]> efficientnetv2_s_stem_mul_1_cast = silu(x = efficientnetv2_s_stem_tpu_batch_normalization_FusedBatchNormV3_nchw_cast);
            tensor<string, []> efficientnetv2_s_blocks_0_Pad_mode_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_0_Pad_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_1_pad_0 = const()[name = tensor<string, []>("pad_1_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<fp16, []> efficientnetv2_s_blocks_0_Pad_constant_val_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_0_Pad_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 24, 130, 130]> pad_1_cast = pad(constant_val = efficientnetv2_s_blocks_0_Pad_constant_val_0_to_fp16, mode = efficientnetv2_s_blocks_0_Pad_mode_0, pad = pad_1_pad_0, x = efficientnetv2_s_stem_mul_1_cast);
            tensor<string, []> efficientnetv2_s_blocks_0_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_0_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_0_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_0_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_0_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_0_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_0_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_0_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_0_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_0_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 24, 3, 3]> efficientnetv2_s_blocks_0_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_0_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [24, 24, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1600)))];
            tensor<fp16, [24]> efficientnetv2_s_blocks_0_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_0_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12032)))];
            tensor<fp16, [1, 24, 128, 128]> efficientnetv2_s_blocks_0_tpu_batch_normalization_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_0_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_0_conv2d_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_0_conv2d_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_0_conv2d_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_0_conv2d_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_0_conv2d_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_0_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16, x = pad_1_cast);
            tensor<fp16, [1, 24, 128, 128]> efficientnetv2_s_blocks_0_mul_1_cast = silu(x = efficientnetv2_s_blocks_0_tpu_batch_normalization_FusedBatchNormV3_nchw_cast);
            tensor<fp16, [1, 24, 128, 128]> efficientnetv2_s_blocks_0_Add_cast = add(x = efficientnetv2_s_blocks_0_mul_1_cast, y = efficientnetv2_s_stem_mul_1_cast);
            tensor<string, []> efficientnetv2_s_blocks_1_Pad_mode_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_1_Pad_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_2_pad_0 = const()[name = tensor<string, []>("pad_2_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<fp16, []> efficientnetv2_s_blocks_1_Pad_constant_val_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_1_Pad_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 24, 130, 130]> pad_2_cast = pad(constant_val = efficientnetv2_s_blocks_1_Pad_constant_val_0_to_fp16, mode = efficientnetv2_s_blocks_1_Pad_mode_0, pad = pad_2_pad_0, x = efficientnetv2_s_blocks_0_Add_cast);
            tensor<string, []> efficientnetv2_s_blocks_1_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_1_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_1_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_1_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_1_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_1_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_1_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_1_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_1_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_1_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 24, 3, 3]> efficientnetv2_s_blocks_1_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_1_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [24, 24, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12160)))];
            tensor<fp16, [24]> efficientnetv2_s_blocks_1_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_1_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22592)))];
            tensor<fp16, [1, 24, 128, 128]> efficientnetv2_s_blocks_1_tpu_batch_normalization_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_1_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_1_conv2d_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_1_conv2d_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_1_conv2d_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_1_conv2d_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_1_conv2d_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_1_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16, x = pad_2_cast);
            tensor<fp16, [1, 24, 128, 128]> efficientnetv2_s_blocks_1_mul_1_cast = silu(x = efficientnetv2_s_blocks_1_tpu_batch_normalization_FusedBatchNormV3_nchw_cast);
            tensor<fp16, [1, 24, 128, 128]> efficientnetv2_s_blocks_1_Add_cast = add(x = efficientnetv2_s_blocks_1_mul_1_cast, y = efficientnetv2_s_blocks_0_Add_cast);
            tensor<string, []> efficientnetv2_s_blocks_2_Pad_mode_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_Pad_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_3_pad_0 = const()[name = tensor<string, []>("pad_3_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<fp16, []> efficientnetv2_s_blocks_2_Pad_constant_val_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_Pad_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 24, 130, 130]> pad_3_cast = pad(constant_val = efficientnetv2_s_blocks_2_Pad_constant_val_0_to_fp16, mode = efficientnetv2_s_blocks_2_Pad_mode_0, pad = pad_3_pad_0, x = efficientnetv2_s_blocks_1_Add_cast);
            tensor<string, []> efficientnetv2_s_blocks_2_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_2_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> efficientnetv2_s_blocks_2_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_2_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_2_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [96, 24, 3, 3]> efficientnetv2_s_blocks_2_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [96, 24, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22720)))];
            tensor<fp16, [96]> efficientnetv2_s_blocks_2_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64256)))];
            tensor<fp16, [1, 96, 64, 64]> efficientnetv2_s_blocks_2_tpu_batch_normalization_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_2_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_2_conv2d_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_2_conv2d_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_2_conv2d_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_2_conv2d_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_2_conv2d_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_2_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16, x = pad_3_cast);
            tensor<fp16, [1, 96, 64, 64]> efficientnetv2_s_blocks_2_mul_1_cast = silu(x = efficientnetv2_s_blocks_2_tpu_batch_normalization_FusedBatchNormV3_nchw_cast);
            tensor<string, []> efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [48, 96, 1, 1]> efficientnetv2_s_blocks_2_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [48, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64512)))];
            tensor<fp16, [48]> efficientnetv2_s_blocks_2_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_2_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(73792)))];
            tensor<fp16, [1, 48, 64, 64]> efficientnetv2_s_blocks_2_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_2_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_2_conv2d_1_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_2_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16, x = efficientnetv2_s_blocks_2_mul_1_cast);
            tensor<string, []> efficientnetv2_s_blocks_3_Pad_mode_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_Pad_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_4_pad_0 = const()[name = tensor<string, []>("pad_4_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<fp16, []> efficientnetv2_s_blocks_3_Pad_constant_val_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_Pad_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 48, 66, 66]> pad_4_cast = pad(constant_val = efficientnetv2_s_blocks_3_Pad_constant_val_0_to_fp16, mode = efficientnetv2_s_blocks_3_Pad_mode_0, pad = pad_4_pad_0, x = efficientnetv2_s_blocks_2_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast);
            tensor<string, []> efficientnetv2_s_blocks_3_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_3_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_3_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_3_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_3_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 48, 3, 3]> efficientnetv2_s_blocks_3_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [192, 48, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(73984)))];
            tensor<fp16, [192]> efficientnetv2_s_blocks_3_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(239936)))];
            tensor<fp16, [1, 192, 64, 64]> efficientnetv2_s_blocks_3_tpu_batch_normalization_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_3_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_3_conv2d_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_3_conv2d_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_3_conv2d_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_3_conv2d_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_3_conv2d_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_3_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16, x = pad_4_cast);
            tensor<fp16, [1, 192, 64, 64]> efficientnetv2_s_blocks_3_mul_1_cast = silu(x = efficientnetv2_s_blocks_3_tpu_batch_normalization_FusedBatchNormV3_nchw_cast);
            tensor<string, []> efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [48, 192, 1, 1]> efficientnetv2_s_blocks_3_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [48, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(240384)))];
            tensor<fp16, [48]> efficientnetv2_s_blocks_3_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_3_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(258880)))];
            tensor<fp16, [1, 48, 64, 64]> efficientnetv2_s_blocks_3_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_3_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_3_conv2d_1_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_3_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16, x = efficientnetv2_s_blocks_3_mul_1_cast);
            tensor<fp16, [1, 48, 64, 64]> efficientnetv2_s_blocks_3_Add_cast = add(x = efficientnetv2_s_blocks_3_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast, y = efficientnetv2_s_blocks_2_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast);
            tensor<string, []> efficientnetv2_s_blocks_4_Pad_mode_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_Pad_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_5_pad_0 = const()[name = tensor<string, []>("pad_5_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<fp16, []> efficientnetv2_s_blocks_4_Pad_constant_val_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_Pad_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 48, 66, 66]> pad_5_cast = pad(constant_val = efficientnetv2_s_blocks_4_Pad_constant_val_0_to_fp16, mode = efficientnetv2_s_blocks_4_Pad_mode_0, pad = pad_5_pad_0, x = efficientnetv2_s_blocks_3_Add_cast);
            tensor<string, []> efficientnetv2_s_blocks_4_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_4_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_4_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_4_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_4_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 48, 3, 3]> efficientnetv2_s_blocks_4_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [192, 48, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(259072)))];
            tensor<fp16, [192]> efficientnetv2_s_blocks_4_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(425024)))];
            tensor<fp16, [1, 192, 64, 64]> efficientnetv2_s_blocks_4_tpu_batch_normalization_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_4_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_4_conv2d_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_4_conv2d_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_4_conv2d_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_4_conv2d_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_4_conv2d_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_4_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16, x = pad_5_cast);
            tensor<fp16, [1, 192, 64, 64]> efficientnetv2_s_blocks_4_mul_1_cast = silu(x = efficientnetv2_s_blocks_4_tpu_batch_normalization_FusedBatchNormV3_nchw_cast);
            tensor<string, []> efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [48, 192, 1, 1]> efficientnetv2_s_blocks_4_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [48, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(425472)))];
            tensor<fp16, [48]> efficientnetv2_s_blocks_4_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_4_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(443968)))];
            tensor<fp16, [1, 48, 64, 64]> efficientnetv2_s_blocks_4_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_4_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_4_conv2d_1_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_4_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16, x = efficientnetv2_s_blocks_4_mul_1_cast);
            tensor<fp16, [1, 48, 64, 64]> efficientnetv2_s_blocks_4_Add_cast = add(x = efficientnetv2_s_blocks_4_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast, y = efficientnetv2_s_blocks_3_Add_cast);
            tensor<string, []> efficientnetv2_s_blocks_5_Pad_mode_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_Pad_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_6_pad_0 = const()[name = tensor<string, []>("pad_6_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<fp16, []> efficientnetv2_s_blocks_5_Pad_constant_val_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_Pad_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 48, 66, 66]> pad_6_cast = pad(constant_val = efficientnetv2_s_blocks_5_Pad_constant_val_0_to_fp16, mode = efficientnetv2_s_blocks_5_Pad_mode_0, pad = pad_6_pad_0, x = efficientnetv2_s_blocks_4_Add_cast);
            tensor<string, []> efficientnetv2_s_blocks_5_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_5_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_5_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_5_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_5_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 48, 3, 3]> efficientnetv2_s_blocks_5_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [192, 48, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(444160)))];
            tensor<fp16, [192]> efficientnetv2_s_blocks_5_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(610112)))];
            tensor<fp16, [1, 192, 64, 64]> efficientnetv2_s_blocks_5_tpu_batch_normalization_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_5_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_5_conv2d_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_5_conv2d_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_5_conv2d_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_5_conv2d_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_5_conv2d_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_5_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16, x = pad_6_cast);
            tensor<fp16, [1, 192, 64, 64]> efficientnetv2_s_blocks_5_mul_1_cast = silu(x = efficientnetv2_s_blocks_5_tpu_batch_normalization_FusedBatchNormV3_nchw_cast);
            tensor<string, []> efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [48, 192, 1, 1]> efficientnetv2_s_blocks_5_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [48, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(610560)))];
            tensor<fp16, [48]> efficientnetv2_s_blocks_5_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_5_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(629056)))];
            tensor<fp16, [1, 48, 64, 64]> efficientnetv2_s_blocks_5_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_5_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_5_conv2d_1_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_5_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16, x = efficientnetv2_s_blocks_5_mul_1_cast);
            tensor<fp16, [1, 48, 64, 64]> efficientnetv2_s_blocks_5_Add_cast = add(x = efficientnetv2_s_blocks_5_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast, y = efficientnetv2_s_blocks_4_Add_cast);
            tensor<string, []> efficientnetv2_s_blocks_6_Pad_mode_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_Pad_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_7_pad_0 = const()[name = tensor<string, []>("pad_7_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<fp16, []> efficientnetv2_s_blocks_6_Pad_constant_val_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_Pad_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 48, 66, 66]> pad_7_cast = pad(constant_val = efficientnetv2_s_blocks_6_Pad_constant_val_0_to_fp16, mode = efficientnetv2_s_blocks_6_Pad_mode_0, pad = pad_7_pad_0, x = efficientnetv2_s_blocks_5_Add_cast);
            tensor<string, []> efficientnetv2_s_blocks_6_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_6_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> efficientnetv2_s_blocks_6_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_6_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_6_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 48, 3, 3]> efficientnetv2_s_blocks_6_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [192, 48, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(629248)))];
            tensor<fp16, [192]> efficientnetv2_s_blocks_6_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(795200)))];
            tensor<fp16, [1, 192, 32, 32]> efficientnetv2_s_blocks_6_tpu_batch_normalization_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_6_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_6_conv2d_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_6_conv2d_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_6_conv2d_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_6_conv2d_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_6_conv2d_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_6_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16, x = pad_7_cast);
            tensor<fp16, [1, 192, 32, 32]> efficientnetv2_s_blocks_6_mul_1_cast = silu(x = efficientnetv2_s_blocks_6_tpu_batch_normalization_FusedBatchNormV3_nchw_cast);
            tensor<string, []> efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 192, 1, 1]> efficientnetv2_s_blocks_6_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [64, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(795648)))];
            tensor<fp16, [64]> efficientnetv2_s_blocks_6_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_6_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(820288)))];
            tensor<fp16, [1, 64, 32, 32]> efficientnetv2_s_blocks_6_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_6_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_6_conv2d_1_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_6_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16, x = efficientnetv2_s_blocks_6_mul_1_cast);
            tensor<string, []> efficientnetv2_s_blocks_7_Pad_mode_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_Pad_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_8_pad_0 = const()[name = tensor<string, []>("pad_8_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<fp16, []> efficientnetv2_s_blocks_7_Pad_constant_val_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_Pad_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 64, 34, 34]> pad_8_cast = pad(constant_val = efficientnetv2_s_blocks_7_Pad_constant_val_0_to_fp16, mode = efficientnetv2_s_blocks_7_Pad_mode_0, pad = pad_8_pad_0, x = efficientnetv2_s_blocks_6_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast);
            tensor<string, []> efficientnetv2_s_blocks_7_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_7_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_7_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_7_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_7_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 64, 3, 3]> efficientnetv2_s_blocks_7_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [256, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(820480)))];
            tensor<fp16, [256]> efficientnetv2_s_blocks_7_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1115456)))];
            tensor<fp16, [1, 256, 32, 32]> efficientnetv2_s_blocks_7_tpu_batch_normalization_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_7_tpu_batch_normalization_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_7_conv2d_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_7_conv2d_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_7_conv2d_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_7_conv2d_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_7_conv2d_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_7_tpu_batch_normalization_FusedBatchNormV3_nchw_weight_0_to_fp16, x = pad_8_cast);
            tensor<fp16, [1, 256, 32, 32]> efficientnetv2_s_blocks_7_mul_1_cast = silu(x = efficientnetv2_s_blocks_7_tpu_batch_normalization_FusedBatchNormV3_nchw_cast);
            tensor<string, []> efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 256, 1, 1]> efficientnetv2_s_blocks_7_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16"), val = tensor<fp16, [64, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1116032)))];
            tensor<fp16, [64]> efficientnetv2_s_blocks_7_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_7_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1148864)))];
            tensor<fp16, [1, 64, 32, 32]> efficientnetv2_s_blocks_7_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast = conv(bias = efficientnetv2_s_blocks_7_tpu_batch_normalization_1_FusedBatchNormV3_nchw_bias_0_to_fp16, dilations = efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_dilations_0, groups = efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_groups_0, pad = efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_pad_0, pad_type = efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_pad_type_0, strides = efficientnetv2_s_blocks_7_conv2d_1_Conv2Dx_strides_0, weight = efficientnetv2_s_blocks_7_tpu_batch_normalization_1_FusedBatchNormV3_nchw_weight_0_to_fp16, x = efficientnetv2_s_blocks_7_mul_1_cast);
            tensor<fp16, [1, 64, 32, 32]> efficientnetv2_s_blocks_7_Add_cast = add(x = efficientnetv2_s_blocks_7_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast, y = efficientnetv2_s_blocks_6_tpu_batch_normalization_1_FusedBatchNormV3_nchw_cast);
            tensor<string, []> efficientnetv2_s_blocks_8_Pad_mode_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_8_Pad_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_9_pad_0 = const()[name = tensor<string, []>("pad_9_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<fp16, []> efficientnetv2_s_blocks_8_Pad_constant_val_0_to_fp16 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_8_Pad_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 64, 34, 34]> pad_9_cast = pad(constant_val = efficientnetv2_s_blocks_8_Pad_constant_val_0_to_fp16, mode = efficientnetv2_s_blocks_8_Pad_mode_0, pad = pad_9_pad_0, x = efficientnetv2_s_blocks_7_Add_cast);
            tensor<string, []> efficientnetv2_s_blocks_8_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_8_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> efficientnetv2_s_blocks_8_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_8_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> efficientnetv2_s_blocks_8_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_8_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> efficientnetv2_s_blocks_8_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_8_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> efficientnetv2_s_blocks_8_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("efficientnetv2_s_blocks_8_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
